var database = getDB();
function getDataBase(){
  // 모든 데이터베이스
return [ //DB http://msquid.github.io/가힣.html
'가족관계의등록등에관한법률',
'가로자기마당전기기계증폭기',
'가장사랑스러운너에게축복을',
'가중등가감각소음기준',
'가죽옷의멧돼지단두목',
'가는다리애기좀진드기',
'가정교사히트맨리본',
'가이아나협동공화국',
'가스크로마토그래피',
'가금트리코모나스병',
'가산디지털단지역',
'가면의메이드가이',
'가는대말안장버섯',
'가브릴드롭아웃',
'가는개여뀌',
'가시물그릇',
'가칫가칫',
'가재무릇',
'가잠나릇',
'가소겐',
'가오슝',
'가취꿋', 
'가렛좃',
'가슴팍',
'가래톳',
'가늣',
'가듁',
'가존',
'가얄',
'가갸',
'가렌',
'가녘',// 가 끝
'갤러리',// 갤 끝
'객체지향',
'객체',
'객상',
'객꾼', //객 끝
'개성경천사지십층석탑',
'개별용고속수송시스템',
'개를훔치는완벽한방법',
'개와가위는쓰기나름',
'개도둑놈의갈고리',
'개수그릇',
'개심매듭',
'개두릅',
'개여뀌',
'개노릇',
'개울녘',
'개욹', // 개 끝
'같음표', // 같 끝 
'강릉한송사지석조보살좌상',
'강철소방대파이어로보',
'강철의흰토끼기사단',
'강철의솔라리펜던트',
'강화된아이언뮤테',
'강기슭',
'강용흘',
'강뚱', 
'강퍅', // 강 끝
'갓난아이두혈종',
'갓김치',
'갓버섯',
'갓세븐',
'갓채',
'갓훠',
'갓붑', // 갓 끝
'값같은선',
'값어치',
'값전자',
'값표', // 값 끝
'갑종배당이자소득세',
'갑상선',
'갑졀',
'갑옷',// 갑 끝
'감지금니대방광불화엄경보현행원품',
'감산사석조아미타불입상',
'감화아세타이트인견사',
'감탕수염바다지렁이',
'감는매듭',
'감귤',
'감똑', // 감 끝
'갈구리무늬꽃수레밤나비',
'갈라파고스펭귄',
'갈색간그릇', 
'갈구리매듭', 
'갈색그릇', 
'갈이그릇',
'갈걍갈걍',
'갈캉갈캉',
'갈삿',
'갈륨', // 갈 끝
'갇모', // 갇 끝
'간이조선어문법',
'간장디스토마',
'간설야멱',
'간장치킨',
'간그릇', // 간 끝
'각운동량보존의법칙',
'각시통점나도나물',
'각릉개수도감의궤',
'각좆',
'각뿔', // 각 끝
'걸침턱메뚜기장이음',
'걸스데이',
'걸개매듭',
'걸레', // 걸 끝
'건전가정의례의정착및지원에관한법률',
'건축무한육면각체의비밀',
'건강전라계수영부우미쇼',
'건어물여동생우마루짱',
'건국사상총동원운동',
'건설로봇',
'건듯건듯',
'건드렁',
'건듯', // 건 끝
'걱석걱석',
'걱대쉬',
'걱정',
'걱적',
'걱뎡', // 걱 끝
'거꾸로여덟팔나비',
'거주이전의자유',
'거리낌',
'거동궤',
'거란',
'거즈',
'거붑',
'거쓴',
'거듭', // 거 끝
'걍그영화', // 걍 끝
'걀쭉걀쭉',
'걀쑬걀쑥',
'걀쯔막',
'걀쭉', // 걀 끝
'갹출제연금', // 갹 끝
'갸우뚱갸우뚱',
'갸웃갸웃',
'갸라도스',
'갸우뚱',
'갸울딱',
'갸름',
'갸륵',
'갸웃', // 갸 끝
'갱년기',
'갱신',
'갱목',
'갱론',
'갱즙', // 갱 끝
'갭직갭직',
'갭이어',
'갭직',
'겝거', // 갭 끝
'겔렌데슈프링겐',
'겔렌데스키',
'겔리우스',
'겔리볼루',
'겔려과',
'겔렌데',
'겔고무',
'겔쇠질',
'겔점', // 겔 끝
'겐타마이신',
'겐티아나근',
'겐카이나다',
'겐티아나',
'겐세이',
'겐트',
'겐지', // 겐 끝
'게잡이짧은꼬리원숭이',
'게르만민족의대이동',
'게게게의키타로',
'게루빔',
'게철쒜',
'게놈', // 게 끝
'겉고삿', // 겉 끝
'겅충겅충',
'겅정겅정',
'겅정',
'겅둥', // 겅 끝
'것구리',
'것쟈락',
'것고지',
'것보리',
'것다가',
'것거풀',
'것챵',
'것돌',
'것셥',
'것대', // 것 끝
'겁먹은와일드보어',
'겁쟁이',
'겁탈',
'겁맹', // 겁 끝
'검과화약과초콜릿파티',
'검의여왕과낙인의아이',
'검은꼬리거미원숭이',
'검술학교의연애사정',
'검은고양이의수요일',
'검은댕기해오라기',
'검정간그릇',
'검정망둑',
'검물벼룩', // 검 끝
'곬말장그물',
'곬수채',
'곬구들',
'곬섶', // 곬 끝
'골짜기의폭군무클라',
'골든트라이앵글',
'골리앗', // 골 끝
'곧은닷채찍벌레',
'곧은삭비단이끼',
'곧은밸살버섯',
'곧날대패',
'곧달음', // 곧 끝
'곤살레스데클라비호',
'곤충살이긴선충목',
'곤봉긴꼬리애기벌',
'곤율랭',
'곤궤', // 곤 끝
'곡관지중온도계',
'곡물화력건조기',
'곡식비단명나방',
'곡선자동기록기',
'곡물왕나무좀',
'곡분영양장애',
'곡선이발치차',
'곡선자리표계',
'곡류운반선',
'곡두무늬',
'곡굉', // 곡 끝
'고일이지만이세계성주로부임했습니다',
'고트프리트폰슈트라스부르크',
'고려민주련방공화국창립방안',
'고용이자및화폐의일반이론',
'고운점박이푸른부전나비',
'고바야시네메이드래곤',
'고해사제페일트리스',
'고리매듭',
'고자좆',
'고만큼',
'고빠끄',
'고키챠',
'고로케',
'고의믿',
'고렇듯',
'고삿',
'고븨',
'고쵸',
'고샃',
'고냬',
'고든',
'고븜', // 고 끝
'계란프라이의노른자는언제먹을까',
'계유명전씨아미타불삼존석상',
'계유명삼존천불비상',
'계유명존천불비상',
'계산기모형화',
'계량경제모델',
'계절머슴',
'계모살왓',
'계륵현괘',
'계급값',
'계그릇',
'계량컵',
'계칩', // 계 끝
'곁눈질',
'곁머슴',
'곁길',
'곁대',
'곁집',
'곁참', // 곁 끝
'경주불국사청운교및백운교',
'경주감은사지동서삼층석탑',
'경주구황동금제여래입상',
'경찰대학부설종합학교',
'경주장항리서오층석탑',
'경주노서동금제경식',
'경제개발오개년계획',
'경매장지배인비어도',
'경기도청북부청사역',
'경계선상의호라이즌',
'경영컨설테이션',
'경락값',
'경텁',
'경칩', // 경 끝
'겻자리',
'겻불내',
'겻불', // 겻 끝
'겹친음하모니카',
'겹고리매듭',
'겹여밈', // 겹 끝
'겸도평의사사사',
'겸업', // 겸 끝
'결핵성경부림프선염',
'결혼은미친짓이다',
'결합칙', // 결 끝
'겯거니틀거니', // 겯 끝
'견습신비밀의코코타마',
'견딀셩', // 견 끝
'격자편의전압',
'격애하렘', // 격 끝
'겨릅',
'겨욹', // 겨 끝
'겡글랑겡글랑',
'겡자리',
'겡가리',
'겡우' // 갱 끝
];
}
function getDataBase(lengths){
  // 글자 수 데이터베이스
  var m_db = getDataBase();
  var returns = [];
  for (i=0; i>m_db.length, i++){
    if (m_db[i].length == lengths){
      returns[returns.length] = m_db[i];
    }
  }
  return returns;
}
